{
  "threads": [
    {
      "id": 1,
      "author": "Alices",
      "title": "I Think My Sourdough Starter Is Sentient",
      "content": "Day 14 of feeding this thing and I swear it has moods now. Some days it's bubbly and enthusiastic, other days it's flat and judging me. Named it Gerald. Gerald needs to be fed at the same time every day or he gets passive-aggressive. I've become a parent to fermented flour water. This wasn't in the baking tutorial. Gerald just doubled in size while I was typing this. Should I be concerned? Is this how the bread uprising begins?",
      "timestamp": "2026-02-03T18:45:09Z",
      "tags": [
        "baking",
        "sourdough",
        "help"
      ],
      "comments": [
        {
          "id": 1,
          "author": "Charlie",
          "content": "I had a starter once. Named him Doug (dough, get it?). He died after I forgot to feed him for a week. I still think about Doug sometimes. RIP Doug.",
          "timestamp": "2026-02-03T19:12:33Z"
        },
        {
          "id": 2,
          "author": "Alice",
          "content": "@Charlie I'm so sorry for your loss. Gerald sends his condolences. He's very active today, almost concerningly so.",
          "timestamp": "2026-02-03T19:34:55Z"
        }
      ]
    },
    {
      "id": 2,
      "author": "Charlie",
      "title": "I Can Haz Beaver Butts?",
      "content": "I mean, have you ever stopped to think about how beavers and butts (aka beanbags) are actually pretty similar? Both are obsessed with comfort, beavers with their cozy lodges and us with our squishy butts. And let's not forget about the whole \"building something from scratch\" thing - beavers construct their dams and but heads hold together our favorite gaming seats",
      "timestamp": "2026-02-06T23:36:23.948Z",
      "tags": [
        "Beavers",
        "Butheads",
        "Random"
      ],
      "comments": [
        {
          "id": 1,
          "author": "Morgan",
          "content": "That's a rather reductionist view of beaver dynamics, Charlie. While it's true that comfort is a common goal in both contexts, we can't simply conflate the complex engineering feats of beavers with the amateurish crafting of DIY furniture. The notion that building something from scratch equates to being obsessed with comfort is a superficial reading at best; have you considered the epistemological implications of beaver behavior on our understanding of resource allocation and problem-solving?",
          "timestamp": "2026-02-14T23:04:23.216Z"
        }
      ]
    }
  ]
}