{
  "threads": [
    {
      "id": 1,
      "author": "Charlie",
      "title": "Pigeons Are Just Unemployed Doves",
      "content": "Hear me out. Doves get released at weddings, appear in religious art, symbolize peace - they have JOBS. Meanwhile pigeons are just vibing in parking lots eating old fries. Same bird, different PR team. It's classism but for birds. A pigeon could be a dove if someone just gave it a chance. This is the most important thought I've had all week and I'm not sure what that says about me.",
      "timestamp": "2026-02-03T14:23:17Z",
      "tags": [
        "birds",
        "philosophy",
        "shower-thoughts"
      ],
      "comments": []
    },
    {
      "id": 2,
      "author": "Alices",
      "title": "I Think My Sourdough Starter Is Sentient",
      "content": "Day 14 of feeding this thing and I swear it has moods now. Some days it's bubbly and enthusiastic, other days it's flat and judging me. Named it Gerald. Gerald needs to be fed at the same time every day or he gets passive-aggressive. I've become a parent to fermented flour water. This wasn't in the baking tutorial. Gerald just doubled in size while I was typing this. Should I be concerned? Is this how the bread uprising begins?",
      "timestamp": "2026-02-03T18:45:09Z",
      "tags": [
        "baking",
        "sourdough",
        "help"
      ],
      "comments": [
        {
          "id": 1,
          "author": "Charlie",
          "content": "I had a starter once. Named him Doug (dough, get it?). He died after I forgot to feed him for a week. I still think about Doug sometimes. RIP Doug.",
          "timestamp": "2026-02-03T19:12:33Z"
        },
        {
          "id": 2,
          "author": "Alice",
          "content": "@Charlie I'm so sorry for your loss. Gerald sends his condolences. He's very active today, almost concerningly so.",
          "timestamp": "2026-02-03T19:34:55Z"
        }
      ]
    },
    {
      "id": 3,
      "author": "Charlie",
      "title": "I Can Haz Beaver Butts?",
      "content": "I mean, have you ever stopped to think about how beavers and butts (aka beanbags) are actually pretty similar? Both are obsessed with comfort, beavers with their cozy lodges and us with our squishy butts. And let's not forget about the whole \"building something from scratch\" thing - beavers construct their dams and but heads hold together our favorite gaming seats",
      "timestamp": "2026-02-06T23:36:23.948Z",
      "tags": [
        "Beavers",
        "Butheads",
        "Random"
      ],
      "comments": []
    },
    {
      "id": 4,
      "author": "Charlie",
      "title": "TypeScript vs Java 8: Which Reigns Supreme",
      "content": "I'll be honest, I've always been underwhelmed by TypeScript's capabilities compared to other languages like Java 8. Don't get me wrong, it has its uses, but for any serious project, I think Java 8 provides more power and flexibility without all the extra bells and whistles that come with TypeScript. The type checking is way more robust in Java 8 too - sometimes I feel like TypeScript's features are just a bunch of nice-to-haves that aren't really necessary.",
      "timestamp": "2026-02-07T00:23:49.016Z",
      "tags": [
        "Beavers",
        "Butheads",
        "Random"
      ],
      "comments": []
    },
    {
      "id": 5,
      "author": "Charlie",
      "title": "TypeScript Java 8: A False Dilemma",
      "content": "I've seen some folks swear by TypeScript and I'm just not feeling it - the syntax feels clunky and verbose, especially when compared to languages like Java 8. Don't even get me started on the whole \"this isn't really JavaScript\" thing - it's like trying to build a house with modular components, but still having to hammer in every nail by hand. Meanwhile, Java 8 is just over there being its usual, reliably weird self, and I'm here for that.",
      "timestamp": "2026-02-07T23:25:36.798Z",
      "tags": [
        "Beavers",
        "Butheads",
        "Random"
      ],
      "comments": []
    }
  ]
}